STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_cm33.h
    VDDCPU_VD_IRQn              = 202,     /*!< VDDCPU voltage detector                        */
    VDDCORE_VD_IRQn             = 203,     /*!< VDDCORE voltage detector                       */
    RESERVED_204                = 204,     /*!< reserved                                       */
    HPDMA1_WKUP_IRQn            = 205,     /*!< HPDMA1 channel 0 to 15 wake up                 */
    HPDMA2_WKUP_IRQn            = 206,     /*!< HPDMA2 channel 0 to 15 wake up                 */
    HPDMA3_WKUP_IRQn            = 207,     /*!< HPDMA3 channel 0 to 15 wake up                 */
    DBG_AUTH_HOST_IRQn          = 208,     /*!< Debugger has written DBG_AUTH_HOST register    */
    DBG_AUTH_ACK_IRQn           = 209,     /*!< Debugger has read DBG_AUTH_ACKregister         */
    RCC_HSI_FMON_IRQn           = 210,     /*!< HSI Frequency Monitor                          */
    RCC_MSI_FMON_IRQn           = 211,     /*!< MSI Frequency Monitor                          */
    RESERVED_212                = 212,     /*!< reserved                                       */
    RESERVED_213                = 213,     /*!< reserved                                       */
    RESERVED_214                = 214,     /*!< reserved                                       */
    RESERVED_215                = 215,     /*!< reserved                                       */
    RESERVED_216                = 216,     /*!< reserved                                       */
    RESERVED_217                = 217,     /*!< reserved                                       */
    RESERVED_218                = 218,     /*!< reserved                                       */
    RESERVED_219                = 219,     /*!< reserved                                       */
    RESERVED_220                = 220,     /*!< reserved                                       */
    RESERVED_221                = 221,     /*!< reserved                                       */
    RESERVED_222                = 222,     /*!< reserved                                       */
    RESERVED_223                = 223,     /*!< reserved                                       */
    RESERVED_224                = 224,     /*!< reserved                                       */
    RESERVED_225                = 225,     /*!< reserved                                       */
    RESERVED_226                = 226,     /*!< reserved                                       */
    RESERVED_227                = 227,     /*!< reserved                                       */
    RESERVED_228                = 228,     /*!< reserved                                       */
    RESERVED_229                = 229,     /*!< reserved                                       */
    RESERVED_230                = 230,     /*!< reserved                                       */
    RESERVED_231                = 231,     /*!< reserved                                       */
    RESERVED_232                = 232,     /*!< reserved                                       */
    RESERVED_233                = 233,     /*!< reserved                                       */
    RESERVED_234                = 234,     /*!< reserved                                       */
    RESERVED_235                = 235,     /*!< reserved                                       */
    RESERVED_236                = 236,     /*!< reserved                                       */
    RESERVED_237                = 237,     /*!< reserved                                       */
    RESERVED_238                = 238,     /*!< reserved                                       */
    RESERVED_239                = 239,     /*!< reserved                                       */
    RESERVED_240                = 240,     /*!< reserved                                       */
    RESERVED_241                = 241,     /*!< reserved                                       */
    RESERVED_242                = 242,     /*!< reserved                                       */
    RESERVED_243                = 243,     /*!< reserved                                       */
    RESERVED_244                = 244,     /*!< reserved                                       */
    RESERVED_245                = 245,     /*!< reserved                                       */
    RESERVED_246                = 246,     /*!< reserved                                       */
    RESERVED_247                = 247,     /*!< reserved                                       */
    RESERVED_248                = 248,     /*!< reserved                                       */
    RESERVED_249                = 249,     /*!< reserved                                       */
    RESERVED_250                = 250,     /*!< reserved                                       */
    RESERVED_251                = 251,     /*!< reserved                                       */
    RESERVED_252                = 252,     /*!< reserved                                       */
    RESERVED_253                = 253,     /*!< reserved                                       */
    RESERVED_254                = 254,     /*!< reserved                                       */
    RESERVED_255                = 255,     /*!< reserved                                       */
    RESERVED_256                = 256,     /*!< reserved                                       */
    RESERVED_257                = 257,     /*!< reserved                                       */
    RESERVED_258                = 258,     /*!< reserved                                       */
    RESERVED_259                = 259,     /*!< reserved                                       */
    RESERVED_260                = 260,     /*!< reserved                                       */
    RESERVED_261                = 261,     /*!< reserved                                       */
    RESERVED_262                = 262,     /*!< reserved                                       */
    RESERVED_263                = 263,     /*!< reserved                                       */
    RESERVED_264                = 264,     /*!< reserved                                       */
    RESERVED_265                = 265,     /*!< reserved                                       */
    RESERVED_266                = 266,     /*!< reserved                                       */
    RESERVED_267                = 267,     /*!< reserved                                       */
    EXTI1_0_IRQn                = 268,     /*!< EXTI1 Line 0 interrupt                         */
    EXTI1_1_IRQn                = 269,     /*!< EXTI1 Line 1 interrupt                         */
    EXTI1_2_IRQn                = 270,     /*!< EXTI1 Line 2 interrupt                         */
    EXTI1_3_IRQn                = 271,     /*!< EXTI1 Line 3 interrupt                         */
    EXTI1_4_IRQn                = 272,     /*!< EXTI1 Line 4 interrupt                         */
    EXTI1_5_IRQn                = 273,     /*!< EXTI1 Line 5 interrupt                         */
    EXTI1_6_IRQn                = 274,     /*!< EXTI1 Line 6 interrupt                         */
    EXTI1_7_IRQn                = 275,     /*!< EXTI1 Line 7 interrupt                         */
    EXTI1_8_IRQn                = 276,     /*!< EXTI1 Line 8 interrupt                         */
    EXTI1_9_IRQn                = 277,     /*!< EXTI1 Line 9 interrupt                         */
    EXTI1_10_IRQn               = 278,     /*!< EXTI1 Line 10 interrupt                        */
    EXTI1_11_IRQn               = 279,     /*!< EXTI1 Line 11 interrupt                        */
    EXTI1_12_IRQn               = 280,     /*!< EXTI1 Line 12 interrupt                        */
    EXTI1_13_IRQn               = 281,     /*!< EXTI1 Line 13 interrupt                        */
    EXTI1_14_IRQn               = 282,     /*!< EXTI1 Line 14 interrupt                        */
    EXTI1_15_IRQn               = 283,     /*!< EXTI1 Line 15 interrupt                        */
    RESERVED_284                = 284,     /*!< reserved                                       */
    RESERVED_285                = 285,     /*!< reserved                                       */
    RESERVED_286                = 286,     /*!< reserved                                       */
    RESERVED_287                = 287,     /*!< reserved                                       */
    RESERVED_288                = 288,     /*!< reserved                                       */
    RESERVED_289                = 289,     /*!< reserved                                       */
    RESERVED_290                = 290,     /*!< reserved                                       */
    RESERVED_291                = 291,     /*!< reserved                                       */
    RESERVED_292                = 292,     /*!< reserved                                       */
    RESERVED_293                = 293,     /*!< reserved                                       */
    RESERVED_294                = 294,     /*!< reserved                                       */
    RESERVED_295                = 295,     /*!< reserved                                       */
    RESERVED_296                = 296,     /*!< reserved                                       */
    RESERVED_297                = 297,     /*!< reserved                                       */
    RESERVED_298                = 298,     /*!< reserved                                       */
    RESERVED_299                = 299,     /*!< reserved                                       */
    RESERVED_300                = 300,     /*!< reserved                                       */
    RESERVED_301                = 301,     /*!< reserved                                       */
    RESERVED_302                = 302,     /*!< reserved                                       */
    RESERVED_303                = 303,     /*!< reserved                                       */
    RESERVED_304                = 304,     /*!< reserved                                       */
    RESERVED_305                = 305,     /*!< reserved                                       */
    RESERVED_306                = 306,     /*!< reserved                                       */
    RESERVED_307                = 307,     /*!< reserved                                       */
    RESERVED_308                = 308,     /*!< reserved                                       */
    RESERVED_309                = 309,     /*!< reserved                                       */
    DDRPERFM_IRQn               = 310,     /*!< DDR Performance Monitor Interrupt              */
    MAX_IRQ_n
  } IRQn_Type;

/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

#define SDC        /*!< Step Down Converter feature */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define CORTEX_IN_SECURE_STATE
#endif

/**
  * @brief Configuration of the Cortex-M33 Processor and Core Peripherals
   */
#define __CM33_REV                0x0100  /*!< Cortex-M33 revision r1p0                       */
#define __MPU_PRESENT             1       /*!< CM33 provides an MPU                           */
#define __SAUREGION_PRESENT       1       /*!< CM33 provides an SAU                           */
#define __NVIC_PRIO_BITS          4       /*!< CM33 uses 4 Bits for the Priority Levels (see IRQLVL) */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used   */
#define __FPU_PRESENT             1       /*!< FPU present                                    */
#define __DSP_PRESENT             1       /*!< DSP extension present                          */
#define __VTOR_PRESENT            1       /*!< Vector Table Offset Register supported         */

#include "core_cm33.h"                     /*!< Cortex-M33 processor and core peripherals      */

/**
  * @}
  */

#include "system_stm32mp2xx.h"
#include <stdint.h>

