STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_cm33.h
  __IO uint32_t FDCANCFGR;          /*!< RCC FDCAN configuration register                                               Address offset: 0x07E0 */
  __IO uint32_t HDPCFGR;            /*!< RCC HDP configuration register                                                 Address offset: 0x07E4 */
  __IO uint32_t ADC1CFGR;           /*!< RCC ADC1 configuration register                                                Address offset: 0x07E8 */
  __IO uint32_t ADC2CFGR;           /*!< RCC ADC2 configuration register                                                Address offset: 0x07EC */
  __IO uint32_t ETH1CFGR;           /*!< RCC Ethernet 1 configuration register                                          Address offset: 0x07F0 */
  __IO uint32_t ETH2CFGR;           /*!< RCC Ethernet 2 configuration register                                          Address offset: 0x07F4 */
       uint32_t RESERVED23;         /*!< Reserved                                                                       Address offset: 0x07F8 */
  __IO uint32_t USBHCFGR;           /*!< RCC USBH configuration register                                                Address offset: 0x07FC */
  __IO uint32_t USB2PHY1CFGR;       /*!< RCC USB2PHY1 configuration register                                            Address offset: 0x0800 */
       uint32_t RESERVED24;         /*!< Reserved                                                                       Address offset: 0x0804 */
  __IO uint32_t OTGCFGR;            /*!< RCC OTG  configuration register                                                Address offset: 0x0808 */
  __IO uint32_t USB2PHY2CFGR;       /*!< RCC USB2PHY2 configuration register                                            Address offset: 0x080C */
       uint32_t RESERVED25[5];      /*!< Reserved                                                                       Address offset: 0x0810-0x820 */
  __IO uint32_t STGENCFGR;          /*!< RCC STGEN configuration register                                               Address offset: 0x0824 */
       uint32_t RESERVED26[2];      /*!< Reserved                                                                       Address offset: 0x0828-0x082C */
  __IO uint32_t SDMMC1CFGR;         /*!< RCC SDMMC1 configuration register                                              Address offset: 0x0830 */
  __IO uint32_t SDMMC2CFGR;         /*!< RCC SDMMC2 configuration register                                              Address offset: 0x0834 */
  __IO uint32_t SDMMC3CFGR;         /*!< RCC SDMMC3 configuration register                                              Address offset: 0x0838 */
       uint32_t RESERVED27;         /*!< Reserved                                                                       Address offset: 0x083C */
  __IO uint32_t LTDCCFGR;           /*!< RCC LTDC configuration register                                                Address offset: 0x0840 */
       uint32_t RESERVED28[5];      /*!< Reserved                                                                       Address offset: 0x0844-0x0854 */
       uint32_t RESERVED_CS;        /*!< Reserved                                                                       Address offset: 0x0858 */
  __IO uint32_t DCMIPPCFGR;           /*!< RCC DCMIPP configuration register                                              Address offset: 0x085C */
  __IO uint32_t DCMIPSSICFGR;       /*!< RCC DCMIPSSI configuration register                                            Address offset: 0x0860 */
       uint32_t RESERVED29[3];      /*!< Reserved                                                                       Address offset: 0x0864-0x086C */
  __IO uint32_t RNG1CFGR;           /*!< RCC RNG1 configuration register                                                Address offset: 0x0870 */
  __IO uint32_t RNG2CFGR;           /*!< RCC RNG2 configuration register                                                Address offset: 0x0874 */
  __IO uint32_t PKACFGR;            /*!< RCC PKA configuration register                                                 Address offset: 0x0878 */
  __IO uint32_t SAESCFGR;           /*!< RCC SAES configuration register                                                Address offset: 0x087C */
  __IO uint32_t HASH1CFGR;          /*!< RCC HASH1 configuration register                                               Address offset: 0x0880 */
  __IO uint32_t HASH2CFGR;          /*!< RCC HASH2 configuration register                                               Address offset: 0x0884 */
  __IO uint32_t CRYP1CFGR;          /*!< RCC CRYP1 configuration register                                               Address offset: 0x0888 */
  __IO uint32_t CRYP2CFGR;          /*!< RCC CRYP2 configuration register                                               Address offset: 0x088C */
       uint32_t RESERVED30;         /*!< Reserved                                                                       Address offset: 0x0890 */
  __IO uint32_t IWDG1CFGR;          /*!< RCC IWDG1 configuration register                                               Address offset: 0x0894 */
  __IO uint32_t IWDG2CFGR;          /*!< RCC IWDG2 configuration register                                               Address offset: 0x0898 */
  __IO uint32_t IWDG3CFGR;          /*!< RCC IWDG3 configuration register                                               Address offset: 0x089C */
  __IO uint32_t IWDG4CFGR;          /*!< RCC IWDG4 configuration register                                               Address offset: 0x08A0 */
  __IO uint32_t WWDG1CFGR;          /*!< RCC WWDG1 configuration register                                               Address offset: 0x08A4 */
  __IO uint32_t RESERVED31;         /*!< Reserved                                                                       Address offset: 0x08A8 */
  __IO uint32_t VREFCFGR;           /*!< RCC VREF configuration register                                                Address offset: 0x08AC */
  __IO uint32_t DTSCFGR;            /*!< RCC DTS configuration register                                                 Address offset: 0x08B0 */
  __IO uint32_t CRCCFGR;            /*!< RCC CRC configuration register                                                 Address offset: 0x08B4 */
  __IO uint32_t SERCCFGR;           /*!< RCC SERC configuration register                                                Address offset: 0x08B8 */
       uint32_t RESERVED32;         /*!< Reserved                                                                       Address offset: 0x08BC */
  __IO uint32_t DDRPERFMCFGR;       /*!< RCC DDRPERFM configuration register                                            Address offset: 0x08C0 */
       uint32_t RESERVED33;         /*!< Reserved                                                                       Address offset: 0x08C4 */
  __IO uint32_t I3C1CFGR;           /*!< RCC I3C1 configuration register                                                Address offset: 0x08C8 */
  __IO uint32_t I3C2CFGR;           /*!< RCC I3C2 configuration register                                                Address offset: 0x08CC */
  __IO uint32_t I3C3CFGR;           /*!< RCC I3C3 configuration register                                                Address offset: 0x08D0 */
       uint32_t RESERVED34[459];    /*!< Reserved                                                                       Address offset: 0x08D4-0x0FFC */
  __IO uint32_t MUXSELCFGR;         /*!< RCC MUXSEL configuration register                                              Address offset: 0x1000 */
       uint32_t RESERVED35[5];      /*!< Reserved                                                                       Address offset: 0x1004-0x1014 */
  __IO uint32_t XBARxCFGR[64];      /*!< RCC Cross Bar x Configuration Register (x=0 to 63)                                              0x1018-0x1114 */
  __IO uint32_t PREDIVxCFGR[64];    /*!< RCC Pre Divider x Configuration Register (x=0 to 63)                                            0x1118-0x1214 */
  __IO uint32_t PREDIVSR1;          /*!< RCC pre divider status register 1                                              Address offset: 0x1218 */
  __IO uint32_t PREDIVSR2;          /*!< RCC pre divider status register 2                                              Address offset: 0x121C */
       uint32_t RESERVED36;         /*!< Reserved                                                                       Address offset: 0x1220 */
  __IO uint32_t FINDIVxCFGR[64];    /*!< RCC Final Divider x Configuration Register (x=0 to 63)                                          0x1224-0x1320 */
  __IO uint32_t FINDIVSR1;          /*!< RCC final divider status register 1                                            Address offset: 0x1324 */
  __IO uint32_t FINDIVSR2;          /*!< RCC final divider status register 2                                            Address offset: 0x1328 */
       uint32_t RESERVED37[5];      /*!< Reserved                                                                       Address offset: 0x132C-0x133C */
  __IO uint32_t FCALCOBS0CFGR;      /*!< RCC clock frequency calculator and observation 0 clock 	configuration register Address offset: 0x1340 */
  __IO uint32_t FCALCOBS1CFGR;      /*!< RCC clock frequency calculator and observation 1 clock 	configuration register Address offset: 0x1344 */
  __IO uint32_t FCALCREFCFGR;       /*!< RCC clock frequency calculator reference clock	configuration register          Address offset: 0x1348 */
  __IO uint32_t FCALCCR1;           /*!< RCC clock frequency calculator control register 1                              Address offset: 0x134C */
       uint32_t RESERVED38;         /*!< Reserved                                                                       Address offset: 0x1350 */
  __IO uint32_t FCALCCR2;           /*!< RCC clock frequency calculator control register 2                              Address offset: 0x1354 */
  __IO uint32_t FCALCSR;            /*!< RCC clock frequency calculator status register                                 Address offset: 0x1358 */
       uint32_t RESERVED39;         /*!< Reserved                                                                       Address offset: 0x135C */
  __IO uint32_t PLL4CFGR1;          /*!< RCC PLL4 configuration register 1                                              Address offset: 0x1360 */
  __IO uint32_t PLL4CFGR2;          /*!< RCC PLL4 configuration register 2                                              Address offset: 0x1364 */
  __IO uint32_t PLL4CFGR3;          /*!< RCC PLL4 configuration register 3                                              Address offset: 0x1368 */
  __IO uint32_t PLL4CFGR4;          /*!< RCC PLL4 configuration register 4                                              Address offset: 0x136C */
  __IO uint32_t PLL4CFGR5;          /*!< RCC PLL4 configuration register 5                                              Address offset: 0x1370 */
       uint32_t RESERVED40;         /*!< Reserved                                                                       Address offset: 0x1374 */
  __IO uint32_t PLL4CFGR6;          /*!< RCC PLL4 configuration register 6                                              Address offset: 0x1378 */
  __IO uint32_t PLL4CFGR7;          /*!< RCC PLL4 configuration register 7                                              Address offset: 0x137C */
       uint32_t RESERVED41[2];      /*!< Reserved                                                                       Address offset: 0x1380-0x1384 */
  __IO uint32_t PLL5CFGR1;          /*!< RCC PLL5 configuration register 1                                              Address offset: 0x1388 */
  __IO uint32_t PLL5CFGR2;          /*!< RCC PLL5 configuration register 2                                              Address offset: 0x138C */
  __IO uint32_t PLL5CFGR3;          /*!< RCC PLL5 configuration register 3                                              Address offset: 0x1390 */
  __IO uint32_t PLL5CFGR4;          /*!< RCC PLL5 configuration register 4                                              Address offset: 0x1394 */
  __IO uint32_t PLL5CFGR5;          /*!< RCC PLL5 configuration register 5                                              Address offset: 0x1398 */
       uint32_t RESERVED42;         /*!< Reserved                                                                       Address offset: 0x139C */
  __IO uint32_t PLL5CFGR6;          /*!< RCC PLL5 configuration register 6                                              Address offset: 0x13A0 */
  __IO uint32_t PLL5CFGR7;          /*!< RCC PLL5 configuration register 7                                              Address offset: 0x13A4 */
       uint32_t RESERVED43[2];      /*!< Reserved                                                                       Address offset: 0x13A8-0x13AC */
  __IO uint32_t PLL6CFGR1;          /*!< RCC PLL6 configuration register 1                                              Address offset: 0x13B0 */
  __IO uint32_t PLL6CFGR2;          /*!< RCC PLL6 configuration register 2                                              Address offset: 0x13B4 */
  __IO uint32_t PLL6CFGR3;          /*!< RCC PLL6 configuration register 3                                              Address offset: 0x13B8 */
  __IO uint32_t PLL6CFGR4;          /*!< RCC PLL6 configuration register 4                                              Address offset: 0x13BC */
  __IO uint32_t PLL6CFGR5;          /*!< RCC PLL6 configuration register 5                                              Address offset: 0x13C0 */
       uint32_t RESERVED44;         /*!< Reserved                                                                       Address offset: 0x13C4 */
  __IO uint32_t PLL6CFGR6;          /*!< RCC PLL6 configuration register 6                                              Address offset: 0x13C8 */
  __IO uint32_t PLL6CFGR7;          /*!< RCC PLL6 configuration register 7                                              Address offset: 0x13CC */
       uint32_t RESERVED45[2];      /*!< Reserved                                                                       Address offset: 0x13D0-0x13D4 */
  __IO uint32_t PLL7CFGR1;          /*!< RCC PLL7 configuration register 1                                              Address offset: 0x13D8 */
  __IO uint32_t PLL7CFGR2;          /*!< RCC PLL7 configuration register 2                                              Address offset: 0x13DC */
  __IO uint32_t PLL7CFGR3;          /*!< RCC PLL7 configuration register 3                                              Address offset: 0x13E0 */
  __IO uint32_t PLL7CFGR4;          /*!< RCC PLL7 configuration register 4                                              Address offset: 0x13E4 */
  __IO uint32_t PLL7CFGR5;          /*!< RCC PLL7 configuration register 5                                              Address offset: 0x13E8 */
       uint32_t RESERVED46;         /*!< Reserved                                                                       Address offset: 0x13EC */
  __IO uint32_t PLL7CFGR6;          /*!< RCC PLL7 configuration register 6                                              Address offset: 0x13F0 */
  __IO uint32_t PLL7CFGR7;          /*!< RCC PLL7 configuration register 7                                              Address offset: 0x13F4 */
       uint32_t RESERVED47[2];      /*!< Reserved                                                                       Address offset: 0x13F8-0x13FC */
  __IO uint32_t PLL8CFGR1;          /*!< RCC PLL8 configuration register 1                                              Address offset: 0x1400 */
  __IO uint32_t PLL8CFGR2;          /*!< RCC PLL8 configuration register 2                                              Address offset: 0x1404 */
  __IO uint32_t PLL8CFGR3;          /*!< RCC PLL8 configuration register 3                                              Address offset: 0x1408 */
  __IO uint32_t PLL8CFGR4;          /*!< RCC PLL8 configuration register 4                                              Address offset: 0x140C */
  __IO uint32_t PLL8CFGR5;          /*!< RCC PLL8 configuration register 5                                              Address offset: 0x1410 */
       uint32_t RESERVED48;         /*!< Reserved                                                                       Address offset: 0x1414 */
  __IO uint32_t PLL8CFGR6;          /*!< RCC PLL8 configuration register 6                                              Address offset: 0x1418 */
  __IO uint32_t PLL8CFGR7;          /*!< RCC PLL8 configuration register 7                                              Address offset: 0x141C */
       uint32_t RESERVED49[15093];  /*!< Reserved                                                                       Address offset: 0x1420-0xFFF0 */
  __IO uint32_t VERR;               /*!< RCC version register                                                           Address offset: 0xFFF4 */
  __IO uint32_t IDR;                /*!< RCC identifier register                                                        Address offset: 0xFFF8 */
  __IO uint32_t SIDR;               /*!< RCC size identification register                                               Address offset: 0xFFFC */
} RCC_TypeDef;
/**
  * @brief RISC Resource Isolation Slave Controller Compartment (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t CIDCFGR;        /*!< RISC CID configuration register for peripheral x */
  __IO uint32_t SEMCR;          /*!< RISC Semaphore control register for peripheral x */
} RISC_Comp_TypeDef;

/**
  * @brief RISC Resource Isolation Slave Controller Peripheral (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t          CR;             /*!< RISC Control register,                                           Address offset: 0x000 */
       uint32_t          RESERVED1[3];   /*!< Reserved,                                                                  0x004-0x00C */
  __IO uint32_t          SECCFGR[6];     /*!< RISC Security configuration register x,                                    0x010-0x024 */
       uint32_t          RESERVED2[2];   /*!< Reserved,                                                                  0x028-0x02C */
  __IO uint32_t          PRIVCFGR[6];    /*!< RISC Privileged configuration register x,                                  0x030-0x044 */
       uint32_t          RESERVED3[2];   /*!< Reserved,                                                                  0x048-0x04C */
  __IO uint32_t          RCFGLOCKR[6];   /*!< RISC Resource configuration lock register x,                               0x050-0x064 */
       uint32_t          RESERVED4[38];  /*!< Reserved,                                                                  0x068-0x0FC */
       RISC_Comp_TypeDef PER[128];       /*!< RISC Compartment configuration for peripheral x                            0x100-0x4FC */
       uint32_t          RESERVED5[256]; /*!< Reserved,                                                                  0x500-0x8FC */
  __IO uint32_t          REG1ACFGR;      /*!< RISAL Region 1 subregion A configuration register,               Address offset: 0x900 */
  __IO uint32_t          RESERVED6[1];   /*!< Reserved,                                                        Address offset: 0x904 */
  __IO uint32_t          REG1BCFGR;      /*!< RISAL Region 1 subregion B configuration register,               Address offset: 0x908 */
  __IO uint32_t          RESERVED7[1];   /*!< Reserved,                                                        Address offset: 0x90C */
  __IO uint32_t          REG2ACFGR;      /*!< RISAL Region 2 subregion A configuration register,               Address offset: 0x910 */
  __IO uint32_t          RESERVED8[1];   /*!< Reserved,                                                        Address offset: 0x914 */
  __IO uint32_t          REG2BCFGR;      /*!< RISAL Region 2 subregion B configuration register,               Address offset: 0x918 */
  __IO uint32_t          RESERVED9[1];   /*!< Reserved,                                                        Address offset: 0x91C */
  __IO uint32_t          REG3ACFGR;      /*!< RISAL Region 3 subregion A configuration register,               Address offset: 0x920 */
  __IO uint32_t          REG3AADDR;      /*!< RISAL Region 3 subregion A address register,                     Address offset: 0x924 */
  __IO uint32_t          REG3BCFGR;      /*!< RISAL Region 3 subregion B configuration register,               Address offset: 0x928 */
  __IO uint32_t          REG3BADDR;      /*!< RISAL Region 3 subregion B address register,                     Address offset: 0x92C */
} RISC_TypeDef;

/**
  * @brief RIMC Resource Isolation Master Controller (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t CR;            /*!< RIMC Configuration register,         Address offset: 0xC00 */
  __IO uint32_t SR;            /*!< RIMC Status register,                Address offset: 0xC04 */
       uint32_t RESERVED1[2];  /*!< Reserved,                                      0xC08-0xC0C */
  __IO uint32_t ATTR[16];      /*!< RIMC Attribute register x,                     0xC10-0xC4C */
} RIMC_TypeDef;

/**
  * @brief RIFSC Resource Isolation Framework Security Controller ID Registers (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t PPSR0;        /*!< RIFSC peripheral protection status register 0, Address offset: 0xFB0 */
  __IO uint32_t PPSR1;        /*!< RIFSC peripheral protection status register 1, Address offset: 0xFB4 */
  __IO uint32_t PPSR2;        /*!< RIFSC peripheral protection status register 2, Address offset: 0xFB8 */
  __IO uint32_t PPSR3;        /*!< RIFSC peripheral protection status register 3, Address offset: 0xFBC */
       uint32_t RESERVED[10]; /*!< Reserved,                               Address offsets: 0xFC0-0xFE4 */
  __IO uint32_t HWCFGR3;      /*!< RIFSC HW configuration register 3,             Address offset: 0xFE8 */
  __IO uint32_t HWCFGR2;      /*!< RIFSC HW configuration register 2,             Address offset: 0xFEC */
  __IO uint32_t HWCFGR1;      /*!< RIFSC HW configuration register 1,             Address offset: 0xFF0 */
  __IO uint32_t VERR;         /*!< RIFSC Version register,                        Address offset: 0xFF4 */
  __IO uint32_t IPIDR;        /*!< RIFSC Identification register,                 Address offset: 0xFF8 */
  __IO uint32_t SIDR;         /*!< RIFSC Size ID register,                        Address offset: 0xFFC */
} RIFSC_ID_TypeDef;

/**
  * @brief RISAB Resource Isolation Slave Unit for Address Space Protection (block-based) Page Compartment (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t PRIVCFGR;      /*!< RISAB Compartment privilege configuration register */
       uint32_t RESERVED1[1];  /*!< Reserved                                           */
  __IO uint32_t RDCFGR;        /*!< RISAB Compartment read configuration register      */
       uint32_t RESERVED2[1];  /*!< Reserved                                           */
  __IO uint32_t WRCFGR;        /*!< RISAB Compartment write configuration register     */
       uint32_t RESERVED3[3];  /*!< Reserved                                           */
} RISAB_PageComp_TypeDef;

