STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_cm33.h
/******************  Bit definition for CRYP_DINR register  *******************/
#define CRYP_DINR_DIN_Pos               (0U)
#define CRYP_DINR_DIN_Msk               (0xFFFFFFFFUL << CRYP_DINR_DIN_Pos)        /*!< 0xFFFFFFFF */
#define CRYP_DINR_DIN                   CRYP_DINR_DIN_Msk                         /*!< Data input */

/******************  Bit definition for CRYP_DOUTR register  ******************/
#define CRYP_DOUTR_DOUT_Pos             (0U)
#define CRYP_DOUTR_DOUT_Msk             (0xFFFFFFFFUL << CRYP_DOUTR_DOUT_Pos)      /*!< 0xFFFFFFFF */
#define CRYP_DOUTR_DOUT                 CRYP_DOUTR_DOUT_Msk                       /*!< Data output */

/****************** Bits definition for CRYP_DMACR register  ******************/
#define CRYP_DMACR_DIEN_Pos              (0U)
#define CRYP_DMACR_DIEN_Msk              (0x1UL << CRYP_DMACR_DIEN_Pos)         /*!< 0x00000001 */
#define CRYP_DMACR_DIEN                  CRYP_DMACR_DIEN_Msk
#define CRYP_DMACR_DOEN_Pos              (1U)
#define CRYP_DMACR_DOEN_Msk              (0x1UL << CRYP_DMACR_DOEN_Pos)         /*!< 0x00000002 */
#define CRYP_DMACR_DOEN                  CRYP_DMACR_DOEN_Msk
/*****************  Bits definition for CRYP_IMSCR register  ******************/
#define CRYP_IMSCR_INIM_Pos              (0U)
#define CRYP_IMSCR_INIM_Msk              (0x1UL << CRYP_IMSCR_INIM_Pos)         /*!< 0x00000001 */
#define CRYP_IMSCR_INIM                  CRYP_IMSCR_INIM_Msk
#define CRYP_IMSCR_OUTIM_Pos             (1U)
#define CRYP_IMSCR_OUTIM_Msk             (0x1UL << CRYP_IMSCR_OUTIM_Pos)        /*!< 0x00000002 */
#define CRYP_IMSCR_OUTIM                 CRYP_IMSCR_OUTIM_Msk
/****************** Bits definition for CRYP_RISR register  *******************/
#define CRYP_RISR_INRIS_Pos              (0U)
#define CRYP_RISR_INRIS_Msk              (0x1UL << CRYP_RISR_INRIS_Pos)         /*!< 0x00000001 */
#define CRYP_RISR_INRIS                  CRYP_RISR_INRIS_Msk                   /*!< Input FIFO service raw interrupt status */
#define CRYP_RISR_OUTRIS_Pos             (1U)
#define CRYP_RISR_OUTRIS_Msk             (0x1UL << CRYP_RISR_OUTRIS_Pos)        /*!< 0x00000002 */
#define CRYP_RISR_OUTRIS                 CRYP_RISR_OUTRIS_Msk                  /*!< Output FIFO service raw interrupt status */
/****************** Bits definition for CRYP_MISR register  *******************/
#define CRYP_MISR_INMIS_Pos              (0U)
#define CRYP_MISR_INMIS_Msk              (0x1UL << CRYP_MISR_INMIS_Pos)         /*!< 0x00000001 */
#define CRYP_MISR_INMIS                  CRYP_MISR_INMIS_Msk
#define CRYP_MISR_OUTMIS_Pos             (1U)
#define CRYP_MISR_OUTMIS_Msk             (0x1UL << CRYP_MISR_OUTMIS_Pos)        /*!< 0x00000002 */
#define CRYP_MISR_OUTMIS                 CRYP_MISR_OUTMIS_Msk

/******************  Bit definition for CRYP_K0LR register  *******************/
#define CRYP_K0LR_K_Pos                 (0U)
#define CRYP_K0LR_K_Msk                 (0xFFFFFFFFUL << CRYP_K0LR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K0LR_K                     CRYP_K0LR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 255 to 224) */

/******************  Bit definition for CRYP_K0RR register  *******************/
#define CRYP_K0RR_K_Pos                 (0U)
#define CRYP_K0RR_K_Msk                 (0xFFFFFFFFUL << CRYP_K0RR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K0RR_K                     CRYP_K0RR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 223 to 192) */

/******************  Bit definition for CRYP_K1LR register  *******************/
#define CRYP_K1LR_K_Pos                 (0U)
#define CRYP_K1LR_K_Msk                 (0xFFFFFFFFUL << CRYP_K1LR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K1LR_K                     CRYP_K1LR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 191 to 160) */

/******************  Bit definition for CRYP_K1RR register  *******************/
#define CRYP_K1RR_K_Pos                 (0U)
#define CRYP_K1RR_K_Msk                 (0xFFFFFFFFUL << CRYP_K1RR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K1RR_K                     CRYP_K1RR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 159 to 128) */

/******************  Bit definition for CRYP_K2LR register  *******************/
#define CRYP_K2LR_K_Pos                 (0U)
#define CRYP_K2LR_K_Msk                 (0xFFFFFFFFUL << CRYP_K2LR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K2LR_K                     CRYP_K2LR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 127 to 96) */

/******************  Bit definition for CRYP_K2RR register  *******************/
#define CRYP_K2RR_K_Pos                 (0U)
#define CRYP_K2RR_K_Msk                 (0xFFFFFFFFUL << CRYP_K2RR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K2RR_K                     CRYP_K2RR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 95 to 64) */

/******************  Bit definition for CRYP_K3LR register  *******************/
#define CRYP_K3LR_K_Pos                 (0U)
#define CRYP_K3LR_K_Msk                 (0xFFFFFFFFUL << CRYP_K3LR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K3LR_K                     CRYP_K3LR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 63 to 32) */

/******************  Bit definition for CRYP_K3RR register  *******************/
#define CRYP_K3RR_K_Pos                 (0U)
#define CRYP_K3RR_K_Msk                 (0xFFFFFFFFUL << CRYP_K3RR_K_Pos)          /*!< 0xFFFFFFFF */
#define CRYP_K3RR_K                     CRYP_K3RR_K_Msk                           /*!< Key bit x (x&#160;=&#160; 31 to 0) */

/******************  Bit definition for CRYP_IV0LR register  ******************/
#define CRYP_IV0LR_IVI_Pos              (0U)
#define CRYP_IV0LR_IVI_Msk              (0xFFFFFFFFUL << CRYP_IV0LR_IVI_Pos)       /*!< 0xFFFFFFFF */
#define CRYP_IV0LR_IVI                  CRYP_IV0LR_IVI_Msk                        /*!< Initialization vector bit x (x&#160;=&#160; 127 to 96) */

/******************  Bit definition for CRYP_IV0RR register  ******************/
#define CRYP_IV0RR_IVI_Pos              (0U)
#define CRYP_IV0RR_IVI_Msk              (0xFFFFFFFFUL << CRYP_IV0RR_IVI_Pos)       /*!< 0xFFFFFFFF */
#define CRYP_IV0RR_IVI                  CRYP_IV0RR_IVI_Msk                        /*!< Initialization vector bit x (x&#160;=&#160; 95 to 64) */

/******************  Bit definition for CRYP_IV1LR register  ******************/
#define CRYP_IV1LR_IVI_Pos              (0U)
#define CRYP_IV1LR_IVI_Msk              (0xFFFFFFFFUL << CRYP_IV1LR_IVI_Pos)       /*!< 0xFFFFFFFF */
#define CRYP_IV1LR_IVI                  CRYP_IV1LR_IVI_Msk                        /*!< Initialization vector bit x (x&#160;=&#160; 63 to 32) */

