STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_cm33.h
#define IS_DMA_PFREQ_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel0_S)  || ((INSTANCE) == HPDMA1_Channel0_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel1_S)  || ((INSTANCE) == HPDMA1_Channel1_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel2_S)  || ((INSTANCE) == HPDMA1_Channel2_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel3_S)  || ((INSTANCE) == HPDMA1_Channel3_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel4_S)  || ((INSTANCE) == HPDMA1_Channel4_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel5_S)  || ((INSTANCE) == HPDMA1_Channel5_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel6_S)  || ((INSTANCE) == HPDMA1_Channel6_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel7_S)  || ((INSTANCE) == HPDMA1_Channel7_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel8_S)  || ((INSTANCE) == HPDMA1_Channel8_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel9_S)  || ((INSTANCE) == HPDMA1_Channel9_NS)  || \
                                         ((INSTANCE) == HPDMA1_Channel10_S) || ((INSTANCE) == HPDMA1_Channel10_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel11_S) || ((INSTANCE) == HPDMA1_Channel11_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel12_S) || ((INSTANCE) == HPDMA1_Channel12_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel13_S) || ((INSTANCE) == HPDMA1_Channel13_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel14_S) || ((INSTANCE) == HPDMA1_Channel14_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel15_S) || ((INSTANCE) == HPDMA1_Channel15_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel0_S)  || ((INSTANCE) == HPDMA2_Channel0_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel1_S)  || ((INSTANCE) == HPDMA2_Channel1_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel2_S)  || ((INSTANCE) == HPDMA2_Channel2_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel3_S)  || ((INSTANCE) == HPDMA2_Channel3_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel4_S)  || ((INSTANCE) == HPDMA2_Channel4_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel5_S)  || ((INSTANCE) == HPDMA2_Channel5_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel6_S)  || ((INSTANCE) == HPDMA2_Channel6_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel7_S)  || ((INSTANCE) == HPDMA2_Channel7_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel8_S)  || ((INSTANCE) == HPDMA2_Channel8_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel9_S)  || ((INSTANCE) == HPDMA2_Channel9_NS)  || \
                                         ((INSTANCE) == HPDMA2_Channel10_S) || ((INSTANCE) == HPDMA2_Channel10_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel11_S) || ((INSTANCE) == HPDMA2_Channel11_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel12_S) || ((INSTANCE) == HPDMA2_Channel12_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel13_S) || ((INSTANCE) == HPDMA2_Channel13_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel14_S) || ((INSTANCE) == HPDMA2_Channel14_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel15_S) || ((INSTANCE) == HPDMA2_Channel15_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel0_S)  || ((INSTANCE) == HPDMA3_Channel0_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel1_S)  || ((INSTANCE) == HPDMA3_Channel1_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel2_S)  || ((INSTANCE) == HPDMA3_Channel2_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel3_S)  || ((INSTANCE) == HPDMA3_Channel3_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel4_S)  || ((INSTANCE) == HPDMA3_Channel4_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel5_S)  || ((INSTANCE) == HPDMA3_Channel5_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel6_S)  || ((INSTANCE) == HPDMA3_Channel6_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel7_S)  || ((INSTANCE) == HPDMA3_Channel7_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel8_S)  || ((INSTANCE) == HPDMA3_Channel8_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel9_S)  || ((INSTANCE) == HPDMA3_Channel9_NS)  || \
                                         ((INSTANCE) == HPDMA3_Channel10_S) || ((INSTANCE) == HPDMA3_Channel10_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel11_S) || ((INSTANCE) == HPDMA3_Channel11_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel12_S) || ((INSTANCE) == HPDMA3_Channel12_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel13_S) || ((INSTANCE) == HPDMA3_Channel13_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel14_S) || ((INSTANCE) == HPDMA3_Channel14_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel15_S) || ((INSTANCE) == HPDMA3_Channel15_NS))

/******************************** EXTI Instances **********************************/
#define IS_EXTI_ALL_INSTANCE(INSTANCE)  ( ((INSTANCE) == EXTI1_S) || ((INSTANCE) == EXTI1_NS) || \
                                          ((INSTANCE) == EXTI2_S) || ((INSTANCE) == EXTI2_NS) )

